VibeScienceSkills/fluid_dynamics/fluid_dynamics/hpc-openfoam/assets/templates/pimplefoam-minimal/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1.0;

deltaT          0.001;

adjustTimeStep  yes;
maxCo           1.0;

writeControl    runTime;
writeInterval   0.05;
purgeWrite      0;

runTimeModifiable true;

// ************************************************************************* //
